placeholder/dbl_0_46_6-00380_9/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];


internalField   nonuniform List<scalar> 
6532
(
0.01
0.03
0.05
0.07
0.09
0.11
0.13
0.15
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 10(0.01 0.03 0.05 0.07 0.09 0.11 0.13 0.15 0.17 0.19);
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 10(2.81 2.83 2.85 2.87 2.89 2.91 2.93 2.95 2.97 2.99);
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
446
(
0
0
0
0
0
0
0
0
...
)
;
    }
    baffle
    {
        type            calculated;
        value           nonuniform List<scalar> 
78
(
0.675
0.675
0.675
0.675
0.675
0.675
0.675
0.675
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
